export const governorates: string[] = [
    'العاصمة الإدارية', 'القاهرة', 'الجيزة', 'الأسكندرية', 'الدقهلية', 'الشرقية', 'القليوبية',
    'البحيرة', 'الغربية', 'كفر الشيخ', 'المنوفية', 'دمياط', 'بورسعيد',
    'الإسماعيلية', 'السويس', 'شمال سيناء', 'جنوب سيناء', 'البحر الأحمر',
    'الوادي الجديد', 'مطروح', 'الفيوم', 'بني سويف', 'المنيا', 'أسيوط',
    'سوهاج', 'قنا', 'الأقصر', 'أسوان'
];

export const cities: { [key: string]: string[] } = {
    'القاهرة': ['عابدين', 'الوايلي', 'الزيتون', 'مصر الجديدة', 'مدينة نصر', 'حلوان', 'المعادي', 'شبرا', 'المرج', 'السلام'],
    'الجيزة': ['الجيزة', 'الهرم', 'إمبابة', 'البدرشين', 'الصف', 'أطفيح', 'العياط', 'أكتوبر', 'الواحات البحرية', 'أوسيم'],
    'الأسكندرية': ['المنتزه', 'شرق', 'وسط', 'غرب', 'العامرية', 'الجمرك', 'برج العرب'],
    'الدقهلية': ['المنصورة', 'طلخا', 'ميت غمر', 'السنبلاوين', 'أجا', 'بلقاس', 'شربين', 'المنزلة', 'دكرنس', 'نبروه'],
    'الشرقية': ['الزقازيق', 'فاقوس', 'بلبيس', 'أبو كبير', 'منيا القمح', 'الحسينية', 'كفر صقر', 'أبو حماد', 'ههيا', 'ديرب نجم'],
    'القليوبية': ['بنها', 'قليوب', 'شبرا الخيمة', 'القناطر الخيرية', 'طوخ', 'كفر شكر', 'الخانكة', 'العبور'],
    'البحيرة': ['دمنهور', 'كفر الدوار', 'رشيد', 'إيتاي البارود', 'أبو حمص', 'حوش عيسى', 'شبراخيت', 'كوم حمادة', 'الدلنجات', 'وادي النطرون'],
    'الغربية': ['طنطا', 'المحلة الكبرى', 'كفر الزيات', 'بسيون', 'زفتى', 'السنطة', 'قطور', 'سمنود'],
    'كفر الشيخ': ['كفر الشيخ', 'دسوق', 'فوه', 'مطوبس', 'بيلا', 'الحامول', 'بلطيم', 'الرياض', 'سيدي سالم'],
    'المنوفية': ['شبين الكوم', 'منوف', 'أشمون', 'الباجور', 'قويسنا', 'بركة السبع', 'تلا', 'الشهداء', 'السادات'],
    'دمياط': ['دمياط', 'فارسكور', 'كفر سعد', 'الزرقا', 'دمياط الجديدة', 'رأس البر'],
    'بورسعيد': ['بورفؤاد', 'حي الشرق', 'حي العرب', 'حي المناخ', 'حي الضواحي', 'حي الجنوب'],
    'الإسماعيلية': ['الإسماعيلية', 'فايد', 'القنطرة شرق', 'القنطرة غرب', 'التل الكبير', 'أبو صوير', 'القصاصين'],
    'السويس': ['السويس', 'الأربعين', 'عتاقة', 'الجناين', 'فيصل'],
    'شمال سيناء': ['العريش', 'بئر العبد', 'الشيخ زويد', 'رفح', 'الحسنة', 'نخل'],
    'جنوب سيناء': ['الطور', 'شرم الشيخ', 'دهب', 'نويبع', 'طابا', 'رأس سدر', 'أبو زنيمة', 'أبو رديس'],
    'البحر الأحمر': ['الغردقة', 'سفاجا', 'القصير', 'مرسى علم', 'رأس غارب', 'الشلاتين', 'حلايب'],
    'الوادي الجديد': ['الخارجة', 'الداخلة', 'الفرافرة', 'باريس', 'بلاط'],
    'مطروح': ['مرسى مطروح', 'الحمام', 'العلمين', 'الضبعة', 'النجيلة', 'سيدي براني', 'السلوم', 'سيوة'],
    'الفيوم': ['الفيوم', 'سنورس', 'طامية', 'إطسا', 'أبشواي', 'يوسف الصديق'],
    'بني سويف': ['بني سويف', 'الواسطى', 'ناصر', 'إهناسيا', 'ببا', 'سمسطا', 'الفشن'],
    'المنيا': ['المنيا', 'سمالوط', 'مطاي', 'بني مزار', 'مغاغة', 'العدوة', 'أبو قرقاص', 'ملوي', 'دير مواس'],
    'أسيوط': ['أسيوط', 'ديروط', 'القوصية', 'أبنوب', 'منفلوط', 'الفتح', 'أبو تيج', 'الغنايم', 'ساحل سليم', 'البداري'],
    'سوهاج': ['سوهاج', 'أخميم', 'جرجا', 'طما', 'طهطا', 'المراغة', 'المنشأة', 'العسيرات', 'البلينا', 'دار السلام'],
    'قنا': ['قنا', 'نجع حمادي', 'دشنا', 'قفط', 'قوص', 'نقادة', 'أبو تشت', 'فرشوط', 'الوقف'],
    'الأقصر': ['الأقصر', 'القرنة', 'أرمنت', 'إسنا', 'الطود', 'البياضية'],
    'أسوان': ['أسوان', 'دراو', 'كوم أمبو', 'نصر النوبة', 'إدفو', 'أبو سمبل'],
    'العاصمة الإدارية': ['الحي الحكومي', 'الحي الدبلوماسي', 'الحي المالي', 'المدينة الطبية', 'الأحياء السكنية', 'مدينة المعرفة', 'المنطقة الرياضية', 'الحي الثقافي']
};
